{"id":164,"date":"2019-09-05T23:17:50","date_gmt":"2019-09-05T17:47:50","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=198"},"modified":"2019-09-05T23:17:51","modified_gmt":"2019-09-05T17:47:51","slug":"religion","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/religion\/","title":{"rendered":"Religion"},"content":{"rendered":"\n<p>We are moving towards a world where religion is driving many people to harm\/kill fellow beings. The concept of religion is good and I feel it has played a very important role in human history by serving as a moral compass. Without any moral compass, we might have got lost and become directionless. <\/p>\n\n\n\n<p>My theory is that any religion (set of rules) was designed to keep the flock together so that the flock could reproduce, be happy and ensure the future generations survive. This worked well when different religion were practiced in different parts of earth, somewhat like WIFI channels. When different people use their own WIFI routers in a same area, we have clashing of channels also called as Interference. Different religions were created at different point of time and have their own biases, plus and minus. Not all religions are same. Some are designed to believe that they are only one existing and as a result are intolerant of others. Some believe that others are substandard product and only they are pure stuff thus causing superiority complex in them. <\/p>\n\n\n\n<p>Humans are complex emotional beings and it would be foolish to believe that our ancestors would have been satisfied with only religion. When we have 10 different companies making similar Android phones, multiple types of alcoholic drinks , hundreds of different food recipes, multiple languages across different cultures how can a single religion satisfy all of us. ?<\/p>\n\n\n\n<p>Coming back to my compass example, In a sea journey we depend on the compass for guidance but we need to understand that there can be rocks or icebergs in way. We need to apply our minds and move by skipping those obstacles. Also different ships may have compass from different brands. This does not mean only your compass is best and only you would reach the destination. Every compass has different features, packaging but they all serve the same purpose &#8211; To help you reach your destination safely and on time. <\/p>\n\n\n\n<p>Sad part is we now have salesmen who spread hate about other religions and try to prove that only the one they practice is best. Some convert others. Some kill. End result is same &#8211; They create and spread lot of poison in the process.<\/p>\n\n\n\n<p>I am not saying that we should give up religion. That would be like to stop eating food since we are gaining weight. We really need to introspect and start teaching the next generation to be more tolerant of others religious choices. Your religion may already have this feature without you realizing but that does not mean you should not appreciate it. In case yours does not has this feature, apply your mind, skip the rocks and icebergs. <\/p>\n\n\n\n<p>Listen to your mind and not to the salesman.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are moving towards a world where religion is driving many people to harm\/kill fellow beings. The concept of religion is good and I feel it has played a very important role in human history by serving as a moral compass. Without any moral compass, we might have got lost and become directionless. My theory &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/religion\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Religion<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/164"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=164"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/164\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=164"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=164"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=164"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}