{"id":169,"date":"2020-05-25T08:17:26","date_gmt":"2020-05-25T02:47:26","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=205"},"modified":"2020-05-25T08:17:27","modified_gmt":"2020-05-25T02:47:27","slug":"balance","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/balance\/","title":{"rendered":"Balance"},"content":{"rendered":"\n<p>Balance &#8211; a word which everyone knows the meaning about but very few are able to apply it in real life. I feel it is one the underrated life principles which does not get enough attention and importance it deserves but is very important. It has the power to transform our lives.<\/p>\n\n\n\n<p>Almost all things which we do in our lifetime are not binary i.e. there is no THIS or THAT , My way or the highway ..etc. There is always some place in between which you can be at and still be happy. It is the ability to identify the point where you need to stop which is difficult to practice. It is difficult because you may have to give up somethings which can make you seem less ambitious or make you appear less successful than your peers. Some of the scenarios where balance helps i feel are below. Of course there will be more important ones , but these are are some of the things which I could think of .<\/p>\n\n\n\n<ol><li>Work life balance.<\/li><li>Balance between earning and spending.<\/li><li>Luxury vs Needs.<\/li><li>Hunger for power \/ status in society.<\/li><\/ol>\n\n\n\n<p>I feel once we honestly start answering the balance related questions and stick to achieve that, life would be lot less stressful and effectively more happier. Convincing ourselves and immediate family is the most difficult part as your definition of balance may be very different of what your spouse or children or parents think of. There are no right and wrong answers.<\/p>\n\n\n\n<p>I am still working on it, I hope you do too.<\/p>\n\n\n\n<p> <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Balance &#8211; a word which everyone knows the meaning about but very few are able to apply it in real life. I feel it is one the underrated life principles which does not get enough attention and importance it deserves but is very important. It has the power to transform our lives. Almost all things &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/balance\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Balance<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/169"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=169"}],"version-history":[{"count":4,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/169\/revisions"}],"predecessor-version":[{"id":145,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/169\/revisions\/145"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=169"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=169"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=169"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}