{"id":173,"date":"2021-04-14T22:52:27","date_gmt":"2021-04-14T17:22:27","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=212"},"modified":"2021-04-14T22:55:36","modified_gmt":"2021-04-14T17:25:36","slug":"solving-a-problem","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/solving-a-problem\/","title":{"rendered":"Solving a problem"},"content":{"rendered":"\n<p>Below are some of my thoughts on how to go about solving  any problem as I have seen many times people seem to go wrong in fixing a problem<\/p>\n\n\n\n<p><em>Disclaimer &#8211; This is based on my experience and what i feel has worked for me in fixing problems. Not everything written here will\/might work for everybody.<\/em><\/p>\n\n\n\n<p><strong>Accept that the problem exists and needs fixing<\/strong> &#8211; One of the most important things but does not get enough credit. Many times its the ego which prevents us from even accepting that there is a problem as it is very uncomfortable to acknowledge that we are in a situation that needs a fix.<\/p>\n\n\n\n<p><strong>Identify the root cause of the problem<\/strong> &#8211; This requires patience and experience. Not many people want to do it as it is not a job which many appreciate and many of those who do end up diagnosing the wrong cause. Always spend good time in finding the correct root cause of the problem. Incorrect root cause diagnosis will lead you to an incorrect solution which can be turnout to be irreversible and expensive sometimes.<\/p>\n\n\n\n<p><strong>Work on fixing the problem &#8211; <\/strong>This  is the step which many people consider as the first but ideally should be the last in the process. There are many ways a problem can be fixed and it depends on many factors such as how painful or inconvenient the solution would be or how fast the fix can be applied etc. <\/p>\n\n\n\n<p>There would be many other factors but i have seen that finding a fix to a problem can be a relatively easy task if we always choose fixes if they work in the long term without creating any new issues and fixing the root cause of the issue. The 1st step would be what i would call a <em>long term fix<\/em>. These fixes are supposed to address the root cause of the problem. There can be times when the fix is too time\/effort\/resource consuming and thus there are chances that the other stakeholders might not be ready to adopt the fix. In such scenarios, it would make sense to create one or multiple fixes which might not necessarily fix the root cause of the problem but would be attractive to the stakeholders as they seem doable and they will solve the immediate problem. Such fixes can be termed as <em>short term fixes<\/em>. This fixes help in solving the immediate problem but there are chances that using the short term fix as a replacement of the long term fix can cause unintended side effects thus creating new problems. Care therefore needs to be taken while designing and using short term fixes that they are used only till the long term fix is in place.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><br><\/p>\n\n\n\n<p><br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Below are some of my thoughts on how to go about solving any problem as I have seen many times people seem to go wrong in fixing a problem Disclaimer &#8211; This is based on my experience and what i feel has worked for me in fixing problems. Not everything written here will\/might work for &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/solving-a-problem\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Solving a problem<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/173"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=173"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/173\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=173"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=173"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}