{"id":28,"date":"2008-02-14T01:23:00","date_gmt":"2008-02-13T19:53:00","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=25"},"modified":"2008-02-14T01:23:00","modified_gmt":"2008-02-13T19:53:00","slug":"where-have-the-indians-gone","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/where-have-the-indians-gone\/","title":{"rendered":"Where have the INDIANS gone ???"},"content":{"rendered":"<p>We Indians are a unique breed. Long time ago in our schools they used to teach us that We Indians are a mix of different culture and hence its a case of unity within diversity. But as i grew  up and going by some recent incidents I feel the reverse is more true. We are indeed guys who love diversity within unity. First we identify ourselves more as &#8220;North Indians&#8221; or &#8220;South Indians&#8221; or any other rare  type of Indian but almost never a plain &#8220;Indian&#8221;. Applying this theory recursively we go on dividing more. A South Indian would then classify himself between different religions such as Hindu, Christians and also into various castes .<\/p>\n<p>It is no surprise that the British ruled us for so many years. They were not any extra brilliant but  we  provided them the right environment to do so by fighting among ourselves which we are still doing , be it the Hindu Muslim rivalry or the attacks of the locals on the &#8220;outsiders&#8221; or any such issues. In fact may be the British got tired and didn&#8217;t find any challenge in ruling us and left us alone to fight among ourselves. <\/p>\n<p>Even today we have the same low level of thinking which is displayed when states fight it out as if they were a separate country in themselves. It may be the Cauvery issue which Karnataka and Tamilnadu may be  fighting or the topic of Outsiders in Maharashtra we fail to realize that most of the times such things benefit only the f*** politicians and nobody else.<\/p>\n<p>The situation may be sad but I sincerely hope for the day I get to see more &#8220;Indians&#8221; .<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We Indians are a unique breed. Long time ago in our schools they used to teach us that We Indians are a mix of different culture and hence its a case of unity within diversity. But as i grew up and going by some recent incidents I feel the reverse is more true. We are &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/where-have-the-indians-gone\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Where have the INDIANS gone ???<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/28"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=28"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/28\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=28"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=28"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=28"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}