{"id":46,"date":"2008-12-02T04:55:46","date_gmt":"2008-12-01T23:25:46","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=46"},"modified":"2008-12-02T04:55:46","modified_gmt":"2008-12-01T23:25:46","slug":"kras-for-the-govt","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/kras-for-the-govt\/","title":{"rendered":"KRA&#8217;s for the Govt"},"content":{"rendered":"<p><strong>The Present<\/strong><\/p>\n<p>In India expect for a few cases (am being generous here) one will find it really difficult to see an example of efficiency in the way government works. This is the place where Indian corporate world shines. They seem to have adopted the right points from the West.<\/p>\n<p>All organizations have a set of KRA&#8217;s (Key Responsible Areas). An employee&#8217;s performance is judged by the points he scores in all the areas defined in his KRA. Every employee is motivated to perform and thus efficiency,productivity automatically increases.This approach requires a senior to monitor to rate the performance of the junior. As seen this approach pays off and work gets done.<\/p>\n<p><strong><span style=\"underline;\">Problem: No Kra&#8217;s<\/span><\/strong><\/p>\n<p>For government we have no such formal KRA defined. The political parties decide their own KRA&#8217;s which only few care to check once they are elected. There is no authority present which monitors the performance of the ruling govt to check if all the points mentioned in the KRA have been successfully completed. This approach only benefits the political parties and the ministers many of them who are only intrested in making money till their tenure lasts.<\/p>\n<p><strong><span style=\"underline;\">Possible Solutions: <\/span><\/strong><\/p>\n<p><strong>Kra&#8217;s defined and monitored<br \/>\n<\/strong><\/p>\n<p>There needs to be some sort of KRA defined for the govt. An approach needs to be taken similar to the Right to Information act where in anybody can get any information from any public govt body . The govt officials are liable for penalty if the required information is not given.An independent authority also needs to monitor the various points in the KRA and publish the results to the public at regular intervals.<\/p>\n<p><strong>Predefined Priorities<br \/>\n<\/strong><\/p>\n<p>The authority could also define the order of priorities the govt should consider.<\/p>\n<p>Eg. A minister might be so obsessed with the late night disco pubs being open that he does not even remember that the police in his state do not even have basic things such as a bullet proof jackets, modern weapons which they need in case of a terrorist attack .<\/p>\n<p>Mumbai 26Nov terrorist attack was a classic example of wrong priorities set by the govt where in security was given the lowest possible consideration whereas it should have been the highest.<\/p>\n<p><strong>Performance Monitoring<br \/>\n<\/strong><\/p>\n<p>The performance of the govt needs to be monitored by an independent authority which needs to work transparently and should be accountable to the public. The results of the performance of the ruling govt should be made public. An explanation needs to be given to the public if any minister has been scoring low for a year for his KRA. If there is no improvement in the performance the minister should be replaced immediately without any delay. This will put in pressure on those ministers who think that this country is their dad&#8217;s private property and they will screw it up in any way they want.<\/p>\n<p>Once the KRA results are available to the public it would not be too hard to guess who will win the next election. This will ensure that all political parties do not sleep after the elections and try continuously to improve their performance.<\/p>\n<p><strong>Final word<\/strong><\/p>\n<p>As Arindam Chaudhry in his book &#8220;Count the chickens before they hatch&#8221; says that &#8220;We Indians tend to be complacent given an opportunity .&#8221;<\/p>\n<p>We do have many examples in front of us to prove Mr Arindam Chaudhry right. If Indian Inc can benefit by this methodology then the govt can surely do.<\/p>\n<p>PS. I did wanted to talk about SLA (Service level agreements) for the govt butÂ  i guess that would be a different post in itself.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Present In India expect for a few cases (am being generous here) one will find it really difficult to see an example of efficiency in the way government works. This is the place where Indian corporate world shines. They seem to have adopted the right points from the West. All organizations have a set &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/kras-for-the-govt\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">KRA&#8217;s for the Govt<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/46"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=46"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/46\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=46"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=46"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=46"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}