{"id":59,"date":"2009-09-08T23:59:42","date_gmt":"2009-09-08T18:29:42","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=64"},"modified":"2009-09-09T00:01:04","modified_gmt":"2009-09-08T18:31:04","slug":"normalization","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/normalization\/","title":{"rendered":"Normalization"},"content":{"rendered":"<p>A friend of mine had an interesting thing to share about the concept of normalization with me. Read on&#8230;<\/p>\n<p>Dictionary.com has the following for the word normalization<\/p>\n<h4><em>nor?mal?ize<\/em><\/h4>\n<p><em>–verb (used with object)<br \/>\n<\/em><\/p>\n<ul>\n<li><em> to make normal.<\/em><\/li>\n<\/ul>\n<p><em>–verb (used without object)<br \/>\n<\/em><\/p>\n<ul>\n<li><em> to become normal; resume a normal state: Prices soon normalized after the war.<\/em><\/li>\n<\/ul>\n<p>When he was a kid his parents used to perform the ritual of normalization when there was a fight between him and his kid brothers and sisters. This was to make them realize that they were equal.<br \/>\nWhen he was in the growing up stages he had realized quite early that no thing such as normalization exists in the outside bad bad world. After all some great guy did say..&#8217;Life is not fair&#8217;.Another one goes like &#8216;There are no free lunches&#8217;.<\/p>\n<p>This was a real simple logic. You had to put in effort if you needed something.<\/p>\n<p><strong>No effort = No rewards<br \/>\nMore effort = More rewards<\/strong><\/p>\n<p>Then he joined a BIG company. A interesting thing of this company&#8217;s HR campaign was that they had a concept of normalization that affected a small area. This area was the payslip part. The corporation made sure that none of its children a.k.a employees were left with any bitter feelings. about their pay check. It used to normalize their pay check amounts.<\/p>\n<p>He was perplexed when he learned that his earlier equation for getting rewarded was not true now.<br \/>\nThere were more complex hidden parameters which had to be considered in that equation. He being a poor engineer and not a rocket scientist struggled real hard and finally managed to create a modified version of his earlier equation<\/p>\n<p><strong>No effort = Good_chance_of_getting_rewarded * some_luck<br \/>\nMore effort = Not_necessarily_more_rewards<br \/>\nE*mc2\/ Normalization * Effort = More_rewards<\/strong><\/p>\n<p>The mystery was now solved. He had finally decoded the normalized truth of life. He was enlightened that no  matter how hard you try you can never be sure that you will get rewarded. Instead he was happy that he had good chances of getting rewarded with almost little effort as observed from the derived equation.<\/p>\n<p>PS. He is still working on the E*mc2 part of the equation so presently he is not in a position to answer any questions about that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A friend of mine had an interesting thing to share about the concept of normalization with me. Read on&#8230; Dictionary.com has the following for the word normalization nor?mal?ize –verb (used with object) to make normal. –verb (used without object) to become normal; resume a normal state: Prices soon normalized after the war. When he was &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/normalization\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Normalization<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/59"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=59"}],"version-history":[{"count":4,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/59\/revisions"}],"predecessor-version":[{"id":58,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/59\/revisions\/58"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=59"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=59"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=59"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}