{"id":131,"date":"2014-02-09T21:13:55","date_gmt":"2014-02-09T15:43:55","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=140"},"modified":"2014-02-09T23:34:13","modified_gmt":"2014-02-09T18:04:13","slug":"how-to-use-whatsapp-on-you-pc","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/how-to-use-whatsapp-on-you-pc\/","title":{"rendered":"How to use WhatsApp on your PC"},"content":{"rendered":"<p>If you have been living under a stone for the past year or two, you might have not heard about WhatsApp. It is a very popular messenger which everybody and their grandmother also seems to be using. In fact it is so popular that many people get a smartphone so that they could use it. Now that the introduction is done, let me show you a way to use WhatsApp even if you don&#8217;t have a smartphone or don&#8217;t intend to buy one yet. Before you look for the instructions let me tell you that you require a working mobile phone number which has not been registered on WhatsApp.<\/p>\n<p>Steps to follow:<\/p>\n<p>1. Download and Install BlueStacks app player on your PC from <a title=\"BlueStacks\" href=\"http:\/\/www.bluestacks.com\" target=\"_blank\">http:\/\/www.bluestacks.com<\/a> . It is a Virtual machine which runs a customized version of Android.<\/p>\n<p>2. Search and install WhatsApp from the Google Play store.<\/p>\n<p>3. During the installation process , you will be sent a SMS with the verification code. The SMS code process did not work for me. It then offered to call my mobile phone for activation which i gladly accepted. I received a call with a automated message stating the verification code which i entered on the app screen.<\/p>\n<p>4. Thats it!. It reads your contacts with phone numbers from your gmail account. You might have to manually enter the phone nos for your gmail contacts to be them available on WhatsApp chat list.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you have been living under a stone for the past year or two, you might have not heard about WhatsApp. It is a very popular messenger which everybody and their grandmother also seems to be using. In fact it is so popular that many people get a smartphone so that they could use it. &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/how-to-use-whatsapp-on-you-pc\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">How to use WhatsApp on your PC<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/131"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=131"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/131\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=131"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=131"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}