{"id":14,"date":"2007-05-16T00:27:00","date_gmt":"2007-05-15T18:57:00","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=10"},"modified":"2008-06-01T18:25:14","modified_gmt":"2008-06-01T12:55:14","slug":"ie-specific-webservices","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/ie-specific-webservices\/","title":{"rendered":"IE specific Webservices"},"content":{"rendered":"<p>The only thing almost all non windows users may miss from time to time  is Internet Explorer on their systems. Though with Firefox now on the rise this need has gone to a drastically low level but there are some instances when u need IE coz the website which u r visiting may provide some service which simply refuses to work on non IE browsers.<\/p>\n<p>I have found 2 categories where IE is forced on u. One being the use of ActiveX controls on the webpage which simply cannot work on non Windows OS such as Linux. I hope all such service providers provide a desktop version for everybody for their respective OS.<\/p>\n<p>The other category of websites come under lame coder websites who prefer to use VBScript in their webpages instead of Javascript . I simply cannot understand their logic behind this.  Just because the developer knows only VBScript is really a pathetic excuse for any body to give. Even Microsoft the inventor of VBScript themselves don&#8217;t use Vbscript everywhere and instead use Javascript in many places.<\/p>\n<p>Infact such websites reduce their coverage (in this case non Windows users) and they are the ones to lose finally.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The only thing almost all non windows users may miss from time to time is Internet Explorer on their systems. Though with Firefox now on the rise this need has gone to a drastically low level but there are some instances when u need IE coz the website which u r visiting may provide some &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/ie-specific-webservices\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">IE specific Webservices<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/14"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=14"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/14\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=14"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=14"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=14"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}