{"id":200,"date":"2016-04-23T19:02:09","date_gmt":"2016-04-23T13:32:09","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=238"},"modified":"2016-04-23T19:07:29","modified_gmt":"2016-04-23T13:37:29","slug":"root-motoe-1st-gen-lollipop-5-1","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/root-motoe-1st-gen-lollipop-5-1\/","title":{"rendered":"Root MotoE 1st gen (Lollipop 5.1)"},"content":{"rendered":"<p>I had a MotoE 1st gen with a insufficient internal storage issue. I have been the unofficial and unpaid brand ambassador of the new Motorola brand of phones for quite some time. The only issue with this phone is that it has limited internal storage and apps like WhatsApp and Facebook which like to eat internal storage in their lunch and dinner leave no space for anything else. This is when I decided to root this phone, luckily which was out of warranty.<\/p>\n<p>I first rooted a MotoE 1st generation phone  in 2015. So this time i.e. in 2016 when I got a chance to root the other MotoE , i was expecting the whole process to complete in a hour or two. To my surprise, it was a tough job when I actually started to work on it. The technique which I was using earlier in 2015 did not seem to work in 2016. Internet still showed me <a href=\"http:\/\/www.kingroot.net\/\">KingoRoot<\/a> app as the only one way to root the phone and it was not working. Some other ways like flashing a custom recovery like TWRP was not working as well.<\/p>\n<p>When I was about to lose hope, an flash of thought struck me. The only difference between the 2 techniques was the OS of the phone. During my 2015 rooting, the phone had a Kitkat OS. This phone which I was trying to root had Lollipop as a part of system upgrade. I decide to downgrade the OS which was possible as some good people at <a href=\"http:\/\/forum.xda-developers.com\/showthread.php?p=54872420#post54872420\">XDA had made available the Kitkat firmware of that phone<\/a>. I downloaded the firmware, set up the phone on Kitkat and then tried rooting the KingoRoot way. As I expected, it worked 🙂  . I installed TWRP and Link2Sd and excellent app which allows you to create move all apps on SD by creating shortcuts \/Linux symbolic links pointing to a Linux partition which makes your app think that it is still using internal storage. Please note that this is not the same as APP2SD feature which works only on very limited apps and in my opinion is useless most of the time. The paid version of the app also allows you to move data folder like Whats&#8217;s app video, images folder to the SD card. I manually did that part by executing unix commands using adbshell , the details of which I will write in a separate post.<\/p>\n<p>Special thanks to makers of <a href=\"http:\/\/www.kingroot.net\/\">KingoRoot<\/a> who make rooting as easy as clicking a button. I wish the app had given a helpful error message saying the OS degrade part (assuming they know about it 🙂 ) but no worries as I finally achieved what I wanted to.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I had a MotoE 1st gen with a insufficient internal storage issue. I have been the unofficial and unpaid brand ambassador of the new Motorola brand of phones for quite some time. The only issue with this phone is that it has limited internal storage and apps like WhatsApp and Facebook which like to eat &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/root-motoe-1st-gen-lollipop-5-1\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Root MotoE 1st gen (Lollipop 5.1)<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/200"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=200"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/200\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=200"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=200"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=200"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}