{"id":218,"date":"2017-12-24T23:04:28","date_gmt":"2017-12-24T17:34:28","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=268"},"modified":"2017-12-24T23:04:28","modified_gmt":"2017-12-24T17:34:28","slug":"my-old-wired-printer-made-wireless","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/my-old-wired-printer-made-wireless\/","title":{"rendered":"My old wired printer made wireless"},"content":{"rendered":"<p>I have a wired HP printer which is quite old but in working condition. It was from the pre -mobile era so it assumed that it would always be sitting next to a desktop machine. Times change and we now have WIFI, mobile and everyone expects everything to be wireless and from a mobile. Being the resident IT support guy i decide to do something about it. I actually worked on it twice.<\/p>\n<p>The first version was few years back before the RaspberryPi came. It was setup using a ASUS router which had a USB port and tomato usb third party firmware similar to DD_WRT which magically adds features to your router which the manufacturer never intended to.I wont explain this much now as I think it wont benefit anyone  NOW (and i am too lazy to type 🙂  ).<\/p>\n<p>The 2nd version which I setup few months back is when the 1st version hardware stopped working and when the RaspberryPi ZeroW was launched. So I decided to go for a Pi based network print server. Its a very powerful piece of hardware and is well worth the money for the form factor. It is a full fledged Linux machine with USB and WIFI ! .This is a ideal machine to be used in kiosk type hardware. I hope they make it lot cheaper so that it becomes a no-brainer choice for such projects.<\/p>\n<h4>Hardware:<\/h4>\n<ol>\n<li>Raspberry Pi ZeroW.<\/li>\n<li>I had to buy a OTG cable  to connect my USB printer to the pi as the pi zerow comes in with microusb only to save space.<\/li>\n<li>It is powered by the commonly available 5v mobile chargers.<\/li>\n<\/ol>\n<h4>Software:<\/h4>\n<ol>\n<li>Installed raspbian OS which is tailor made for Pi.<\/li>\n<li>Setup pi to work in headless mode (no display) as it required a micro HDMI connector and i did not wanted to spend on one. This involves giving a static IP to the Pi and enabling SSH so that you can remotely log in from other machines through SSH and do whatver you want.<\/li>\n<li>Installed CUPS the powerful print server software which converts the innocent pi to a Network enabled printer.<\/li>\n<\/ol>\n<p><strong>Linux<\/strong> &#8211; I tested this setup on Fedora. Almost all linux OS&#8217;s have built in support of CUPS based printer and their configuration utilities will auto detect once you provide the IP of the pi.<\/p>\n<p><strong>Windows<\/strong> &#8211; I currently dont have a windows machine but I am pretty sure this should also work on Windows out of the box.<\/p>\n<p><strong>Android<\/strong> &#8211; There is a app available on android called LetsPrintDroid which easily setups CUPS enabled print server found on the network and allows you to print documents directly from the mobile without requiring any desktop\/laptop. This is slowly becoming my preferred mode when all i want is a quick print without waiting for my desktop to be UP and running.<\/p>\n<p>Whenever the printer is powered ON, the pi also boots up and within a minute connects to the WIFI and is ready to serve print requests from my home network.<\/p>\n<p><a href=\"\/blogs\/linux\/wp-content\/pi_zerow2.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone  wp-image-269\" src=\"\/blogs\/linux\/wp-content\/pi_zerow2-225x300.jpg\" alt=\"\" width=\"490\" height=\"653\" \/><\/a><\/p>\n<p><a href=\"\/blogs\/linux\/wp-content\/pi_zerow1.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone  wp-image-270\" src=\"\/blogs\/linux\/wp-content\/pi_zerow1-225x300.jpg\" alt=\"\" width=\"494\" height=\"659\" \/><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>I have a wired HP printer which is quite old but in working condition. It was from the pre -mobile era so it assumed that it would always be sitting next to a desktop machine. Times change and we now have WIFI, mobile and everyone expects everything to be wireless and from a mobile. Being &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/my-old-wired-printer-made-wireless\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">My old wired printer made wireless<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/218"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=218"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/218\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=218"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=218"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=218"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}