{"id":224,"date":"2018-03-18T22:51:20","date_gmt":"2018-03-18T17:21:20","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=277"},"modified":"2019-09-05T22:35:33","modified_gmt":"2019-09-05T17:05:33","slug":"make-your-existing-router-using-hotspot-wifi-internet","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/make-your-existing-router-using-hotspot-wifi-internet\/","title":{"rendered":"Make your existing router use hotspot wifi internet"},"content":{"rendered":"<p>UPDATE (5-SEP-2019) &#8211;<em> There is something called <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wireless_Internet_service_provider\">WISP<\/a> (Wireless ISP) mode in almost all new routers in market now. This mode solves the exact problem which I was trying to solve back then. I upgraded to a TPLINK router which has this mode and it works beautifully. You can still go ahead and read the below post for academic purpose or just to know some ways I keep on wasting my time 🙂 <\/em><\/p>\n<p>&#8212;&#8212;&#8211;ORIGINAL POST BELOW&#8212;&#8212;&#8212;&#8212;&#8211;<\/p>\n<p>I have a NETGEAR WNR612 router which is simple no frills device and does the job its made for. It connects to a modem with Ethernet output for Internet and connects its wired and wireless clients to Internet. Recently i decided to drop my wired broadband and go for JIOFI device which uses the Reliance Jio network and has really attractive prices.<\/p>\n<p><strong>Problem:<\/strong> How to connect my existing router to use the internet from the Jio hotspot device<\/p>\n<p>JioFI and other hotspot variants are technically 2 devices combined into 1 . There is a modem which takes your SIM and connects to the network for internet . There is another piece of hardware which takes this internet and creates a wifi network. The usual routers available in market assume that there will always be a wired internet available at an RJ45 Ethernet WAN port for which they have to create the wifi network. Technically if you are using a hotspot device there is no need for another router which also does the same job. Well in my case my router is responsible for creating my home LAN network and also has a much larger range than the hotspot device. I have a wireless printer which connects to my home network for print jobs. There are other devices which use the router WIFI for internet. The problem statement here was to somehow add the functionality in my router so that it can get the internet from the hotspot and beam it own Wifi network so that the other clients are not disturbed. They get the same internet as always and are unaware that anything has changed, which is how it should be.<\/p>\n<p>A google search revealed several posts and videos which recommend to use <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wireless_distribution_system\">WDS ie Wireless Distribution System<\/a>. My router did not support this mode. Also WDS is a variant of repeater mode which means your hotspot would be responsible for creating and maintaining the LAN using DHCP.  Your older router would act as a subordinate which is what i did not want as the hotspot did not offer much customization.<\/p>\n<p><strong>Solution:<\/strong> I put my R&amp;D hat on. I had an old Linksys router lying around on which I had installed DDWRT the powerful firmware sometime back but was not using it. <a href=\"http:\/\/www.dd-wrt.com\">DDWRT<\/a>  is a beautiful and powerful piece of software which turbo chargers your routers with features which the manufactures never intended to built into the product. I had written about it in the past <a href=\"http:\/\/www.latish-sherigar.com\/blogs\/linux\/cheaper-way-to-increasing-your-wifi-range\/\">here<\/a>. There are modes in which the router can be configured.<\/p>\n<p><a href=\"http:\/\/www.latish-sherigar.com\/blogs\/linux\/wp-content\/20180318_211558.jpg\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone size-medium wp-image-278\" src=\"http:\/\/www.latish-sherigar.com\/blogs\/linux\/wp-content\/20180318_211558-300x261.jpg\" alt=\"\" width=\"300\" height=\"261\" \/><\/a><\/p>\n<p>Access point is the mode in which we expect our routers to operate in which it converts wired to wifi. &#8216;Client&#8217; mode is what would solve my problem. In this mode the devices acts as a client and connects to the hotspot wifi and provides the internet in to the router LAN ports. This LAN port of the intermediate router needs to be connected to the WAN port of the main router. This is all that is needed.<\/p>\n<p>My main router now connects to the Linksys router with DDWRT which in turn connects to the wifi hotspot for internet. Another day , new learning!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>UPDATE (5-SEP-2019) &#8211; There is something called WISP (Wireless ISP) mode in almost all new routers in market now. This mode solves the exact problem which I was trying to solve back then. I upgraded to a TPLINK router which has this mode and it works beautifully. You can still go ahead and read the &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/make-your-existing-router-using-hotspot-wifi-internet\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Make your existing router use hotspot wifi internet<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/224"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=224"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/224\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=224"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=224"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=224"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}