{"id":229,"date":"2019-01-19T19:17:27","date_gmt":"2019-01-19T13:47:27","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=285"},"modified":"2019-01-19T19:17:30","modified_gmt":"2019-01-19T13:47:30","slug":"building-remote-for-my-media-center-pc","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/building-remote-for-my-media-center-pc\/","title":{"rendered":"Building remote for my media center PC"},"content":{"rendered":"<p>Around a year back I had <a href=\"\/blogs\/linux\/how-i-built-my-media-center-pc-htpc\/\">posted<\/a> on how I built my media center PC aka HTPC (Home Theater Personal Computer) . I had been operating that using my wireless keyboard and mouse which satisfied all my functional requirements. To work as a true media center though i felt it had to work with a standard television remote.<\/p>\n<p>I had therefore thought of adding a Infrared receiver (IR) connected to my media center PC which would allow me to use a regular TV\/ DVD remote control to operate it. I looked around for some ready made IR receivers but the only one i found decent enough was <a href=\"https:\/\/flirc.tv\/more\/flirc-usb\">Flirc<\/a> . The price was on higher side though which was around 20 USD in addition to availability only in US. This meant that I had to wait for someone coming back to India from US in addition to paying a good amount of money. I therefore decided to go ahead and build my own.<\/p>\n<p>Requirement:<\/p>\n<p>A micro controller based circuit which will accept commands from any existing remote control and pass these as keyboard commands.<\/p>\n<p>Components required -:<\/p>\n<ol>\n<li><span class=\"il\">Pro<\/span> <span class=\"il\">Micro<\/span> 5V 16M Mini Leonardo <span class=\"il\">Micro<\/span>-controller Development Board For Arduino<\/li>\n<li>TSOP1738 Infrared receiver.<\/li>\n<\/ol>\n<p>Details-:<\/p>\n<p>The Pro micro Arduino board has a great feature that it can act as standard USB keyboard to your PC with the help of a library. This made the work a lot easier as I then only had to read the IR remote commands and then convert them into equivalent USB keys and send them to PC. For the PC , it appears like it is just a standard keyboard and therefore no special driver or any software is required to be installed on the PC. Every IR remote sends a different set of commands for every key and after some debugging, I had the list of commands which my DVD remote was using. After coding that into the arduino code and writing some new code to map it to PC keys, the thing was working as expected. I then used a old Nokia charger which I had lying around to place the arduino and the IR receiver. Below is the working video and some pics of the board and the final product.<\/p>\n<p>[embedyt] https:\/\/www.youtube.com\/watch?v=OQekaL9HOUY[\/embedyt].<\/p>\n<p> <img decoding=\"async\" src=\"\/blogs\/linux\/wp-content\/IMG-20180925-WA0009.jpg\" \/><\/p>\n<p><img decoding=\"async\" src=\"\/blogs\/linux\/wp-content\/IMG-20190119-WA0008.jpg\" \/> <\/p>\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Around a year back I had posted on how I built my media center PC aka HTPC (Home Theater Personal Computer) . I had been operating that using my wireless keyboard and mouse which satisfied all my functional requirements. To work as a true media center though i felt it had to work with a &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/building-remote-for-my-media-center-pc\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Building remote for my media center PC<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/229"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=229"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/229\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=229"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=229"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}