{"id":258,"date":"2019-09-05T22:27:59","date_gmt":"2019-09-05T16:57:59","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=331"},"modified":"2019-09-05T22:28:00","modified_gmt":"2019-09-05T16:58:00","slug":"raspberry-pi-media-center","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/raspberry-pi-media-center\/","title":{"rendered":"Raspberry Pi Media center"},"content":{"rendered":"\n<p>I was a big believer of HTPC (Home Theater Personal computer) and therefore upgraded my desktop some time back so that it could be connected to my Yamaha AV receiver. I also custom built\/modified a <a href=\"\/blogs\/linux\/building-remote-for-my-media-center-pc\/\">custom remote<\/a> using a old DVD player remote so that I could operate it without using a keyboard\/mouse. In case you are interested in details of that build <a href=\"\/blogs\/linux\/building-remote-for-my-media-center-pc\/\">here is the post<\/a>. <\/p>\n\n\n\n<p>I used this setup for some time but later came to the conclusion that the desktop form factor  does not fit well in a living room media player setup. At this point I decided to give Raspberry pi a try. I had an Model B+ lying around which was just used by me once in a while for my experiments. I had the impression that it would crash or in worst case burnout with the &#8220;heavy&#8221; media files i was going to throw at it. I still went ahead withe the following setup<\/p>\n\n\n\n<ol><li>Media &#8211;  A USB portable  hard disk which had my media files.<\/li><li>USB remote &#8211; The one i mentioned above<\/li><li>Display &#8211; HDMI output connected to TV.<\/li><li>Audio &#8211; USB to Optical \/ TOSLINK audio sound card which is then connected to my AV receiver.<\/li><li>Internet (Optional) &#8211; A USB WIFI adapter which can be used for installing additional software or getting updates.<\/li><li>Operating System &#8211; OSMC &#8211; <a href=\"https:\/\/osmc.tv\/\">https:\/\/osmc.tv<\/a><\/li><\/ol>\n\n\n\n<p>I was blown away by the performance of the setup. It was performing exactly like my desktop computer without any slowness.The audio and video play back was super smooth. I was also able to get Dolby Digital output from the sound card without any effort. OSMC is a beauty and works like a charm. Full marks to its developers.<\/p>\n\n\n\n<p>I am extremely happy with the current setup and also proud of myself (especially the remote 🙂 for getting this setup working.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I was a big believer of HTPC (Home Theater Personal computer) and therefore upgraded my desktop some time back so that it could be connected to my Yamaha AV receiver. I also custom built\/modified a custom remote using a old DVD player remote so that I could operate it without using a keyboard\/mouse. In case &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/raspberry-pi-media-center\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Raspberry Pi Media center<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/258"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=258"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/258\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=258"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=258"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=258"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}