{"id":33,"date":"2008-03-09T21:47:00","date_gmt":"2008-03-09T16:17:00","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=29"},"modified":"2008-06-02T05:18:21","modified_gmt":"2008-06-01T23:48:21","slug":"free-and-open-source-software","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/free-and-open-source-software\/","title":{"rendered":"Free and Open Source Software"},"content":{"rendered":"<p>Many in the non Windows world are confused between Free\/Open source software. Free software is considered to free of cost while open source software is considered software with source given to you . These 2 camps have different philosophies. This really confuses many people and even I was confused when i had come across these terms. It took some time for me to actually understand what these actually mean. Below is a short attempt from me.<\/p>\n<p><span style=\"font-weight: bold;\">Free Software:<\/span> In terms of cost these can be free of cost or NOT. The free part is the freedom you will  be given to modify,redistribute this software to others. Just FYI non free software not necessarily give you the legal rights to modify,redistribute the modified software. Thus cost is not the philosophy behind it. Free software can be charged . A software to be called as Free software needs to fulfill the requirements which they have defined.<\/p>\n<p>This is the quote from the website of Free Software Foundation<\/p>\n<p><span style=\"font-style: italic;\">&#8220;Free software&#8221; is a matter of liberty, not price. To understand the concept, you should think of &#8220;free&#8221; as in &#8220;free speech,&#8221; not as in &#8220;free beer.&#8221;<\/span><\/p>\n<p>If you need the full text check the Free Software Definition available at FSF.<br \/>\n<a href=\"http:\/\/www.fsf.org\/licensing\/essays\/free-sw.html\">http:\/\/www.fsf.org\/licensing\/essays\/free-sw.html<\/a><\/p>\n<p>Linux is an example of Free Software for it allows anybody to see,modify,redistribute the software.Only the name &#8220;Linux&#8221; is copyrighted, the code is not.<\/p>\n<p><span style=\"font-weight: bold;\">Open Source:<\/span> Open source is a branched out version of free software with some philosophical differences. The software which falls in this category are software for which the source of these will be given to you but not necessarily you can change or redistribute it. For eg Company ABC might make a software open source but it might not give the rights to anybody to modify the software and would own full rights to it. This would be the software with a company selling software to a defense organization who might to know what the code actually does so that it does not compromise on security. They may not want to change the software though.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many in the non Windows world are confused between Free\/Open source software. Free software is considered to free of cost while open source software is considered software with source given to you . These 2 camps have different philosophies. This really confuses many people and even I was confused when i had come across these &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/free-and-open-source-software\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Free and Open Source Software<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/33"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=33"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/33\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=33"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=33"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=33"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}