{"id":37,"date":"2008-07-01T11:39:55","date_gmt":"2008-07-01T06:09:55","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=33"},"modified":"2008-07-01T15:55:09","modified_gmt":"2008-07-01T10:25:09","slug":"should-coding-be-really-avoided","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/should-coding-be-really-avoided\/","title":{"rendered":"Should Coding be Really Avoided ?"},"content":{"rendered":"<p>This post is specifically for my software coder friends who are presently coding or have done it in the past. Every software developer after leaving college dreams of a job where he will be building great software . If he is lucky he will get a really good job where in he will be able to fulfill his dream of coding all day long and making some great software. If he is more lucky he might even get a decent salary for doing this stuff.<\/p>\n<p>Recently during some discussions one of my office colleagues who was promoted to a position of &#8220;Team lead&#8221; was announcing that he has  &#8220;given up&#8221; coding and he was now not at all interested in even looking at the code. I had encountered similar situations before where in a person was recruited as a team lead and was asked do some coding since he did not have much idea about the product the company sold . Mr Team Lead disappeared after 10 days and left behind an email saying that he was &#8220;demotivated as he did not want to return to a coding job&#8221;<\/p>\n<p>Personally i think a small amount of coding is absolutely necessary and should be reduced if at all depending upon ones job profile. If one moves to a managerial position or something similar, he could give up looking at the code altogether. But if you have developers working in your team then it would be absolutely crazy if you decide not to look at the code as then you will surely lose respect among your team as they expect you to bail them out whenever they are stuck up somewhere .<\/p>\n<p>Why did this concept come up that as you move up the ladder you reduce the amount of code you write. ??? The answer to this is simple. More work happens by delegation. If you are good at your job you finish only 25% of the job but as a lead you would be able to &#8220;code&#8221; all the 100% with 4 developers working in your team though you may not actually code . You monitor them . You review the code. Since some &#8220;hardcore coders&#8221; fail to understand this theory even when they complete few years on their job their bosses have to tell them that they are not supposed to do coding now. I guess since many fail to explain it in a better way there is this wrong myth that coding or even looking at code should be avoided at all costs.<\/p>\n<p>Personally i feel everyone needs to continue some amount of coding irrespective of his position in the ladder so that he is not out of touch and when there is a situation he can easily face it. This could be coding for hobby projects or the official work but some amount at regular intervals definitely helps.<\/p>\n<p>I still feel that many could have exactly opposite views than the one expressed above . Will surely update this post if i get some convincing opposite view about this.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This post is specifically for my software coder friends who are presently coding or have done it in the past. Every software developer after leaving college dreams of a job where he will be building great software . If he is lucky he will get a really good job where in he will be able &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/should-coding-be-really-avoided\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Should Coding be Really Avoided ?<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/37"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=37"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/37\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=37"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=37"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=37"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}