{"id":6,"date":"2007-04-24T00:59:00","date_gmt":"2007-04-23T19:29:00","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=3"},"modified":"2008-06-01T18:17:27","modified_gmt":"2008-06-01T12:47:27","slug":"which-distribution-should-i-use","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/which-distribution-should-i-use\/","title":{"rendered":"Which distribution should i use ????"},"content":{"rendered":"<p>Most of the times this is the 2nd question which comes to a newbie&#8217;s mind regarding Linux, the first being the major decision to use Linux. Almost all of them have an impression that all the distribution have major differences like that of between Windows and Linux.<br \/>\nRest assured this is not the case. Except some major distributions which are philosophically different e.g. A Debian System and a Red Hat System , majority of them don&#8217;t have much differences.<br \/>\nIn simple terms..they are just distributions..kind of packing all the available things with something of their own.<br \/>\nThe main operation system would still be Linux . The Desktop would be either GNOME or KDE based but not necessary (yes u can have multiple desktops environment in a single distribution unlike Windows). The versions of the components may differ. E.g . Red hat&#8217;s Fedora Core may have Gnome 2.8 whereas Ubuntu (another recommended newbie distribution) may have 2.6 in it.<\/p>\n<p>I personally find both Fedora core series ( i am currently using Fedora Core5) and Ubuntu to be good choices for newbies.Fedora has more packages than Ubuntu,but that doesn&#8217;t mean that any of  the necessary packages is missing from Ubuntu.At last its a matter of personal taste..I recommended to try both or some more and decide yourselves.<\/p>\n<p>I don&#8217;t want to list all the options available as the information here was created to help Linux newbies and not to scare them off. Therefore if u find u r favorite distribution or desktop environment name not listed out, u know the reason why!.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most of the times this is the 2nd question which comes to a newbie&#8217;s mind regarding Linux, the first being the major decision to use Linux. Almost all of them have an impression that all the distribution have major differences like that of between Windows and Linux. Rest assured this is not the case. Except &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/which-distribution-should-i-use\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Which distribution should i use ????<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/6"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=6"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/6\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=6"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=6"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=6"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}