{"id":67,"date":"2011-02-11T12:41:31","date_gmt":"2011-02-11T07:11:31","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=64"},"modified":"2011-02-11T15:14:44","modified_gmt":"2011-02-11T09:44:44","slug":"should-i-buy-a-tablet","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/should-i-buy-a-tablet\/","title":{"rendered":"Should I buy a tablet?"},"content":{"rendered":"<div>I get this query from time to time. (The frequency has increased to much more times in a day due to the recent rush of tablets in to the Indian market). I decided to write it once here and make them read it instead of repeating the same stuff every time.<\/div>\n<p>The answer is &#8211; It Depends.<\/p>\n<p>It depends on the purpose of your usage. PC users can be classified into broadly 2 types<\/p>\n<ol>\n<li>Information Consumers: &#8211; Web Browsing (Email, Blogs )etc.<\/li>\n<li>Information Producers: &#8211; Spreadsheets, Documentation,Designing, Programming etc.<\/li>\n<\/ol>\n<p>If you are a information consumer i.e one who consumes information from Internet or various software applications then the tablets are for you. If you are a information producer then you should be really looking into a notebook\/laptop or the plain old desktop.<\/p>\n<p>Tablets such as the Apple Ipad, Samsung Galaxy tab, etc, etc are really good at Consumption but they fare poorly for Production. They lie somewhere between a smart Phone and a PC and therefore serves as a really great secondary computing device (if you do not mind spending the $ for the extra luxury).<\/p>\n<p>To summarize Tablets are a great device for those who find PC too complicated\/boring\/overwhelming to use for tasks like checking Email or reading news on the Internet.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I get this query from time to time. (The frequency has increased to much more times in a day due to the recent rush of tablets in to the Indian market). I decided to write it once here and make them read it instead of repeating the same stuff every time. The answer is &#8211; &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/should-i-buy-a-tablet\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Should I buy a tablet?<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/67"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=67"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/67\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=67"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=67"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=67"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}