{"id":92,"date":"2011-11-08T22:58:08","date_gmt":"2011-11-08T17:28:08","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/linux\/?p=89"},"modified":"2011-11-08T22:58:08","modified_gmt":"2011-11-08T17:28:08","slug":"how-offline-registry-editing-with-windows-7-saved-my-life-kidding","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/linux\/how-offline-registry-editing-with-windows-7-saved-my-life-kidding\/","title":{"rendered":"How Offline registry editing with Windows 7 saved my life (Kidding)"},"content":{"rendered":"<p>Every time I install windows I find a new way to screw up things. In this process i also manage to learn something new. This time it was a kool issue which resulted in a deadlock.<\/p>\n<ol>\n<li>Installed Win 7. The &#8220;Administrator&#8221; user is disabled during installation.<\/li>\n<li>Created a user which had administrative privileges.<\/li>\n<li>Changed the default ProfileListPath (HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\ProfileList) registry key so that User data is stored on some other drive. (In this process did a typo in the ProfileListPath.<\/li>\n<li>Created another user with Administrative privileges.<\/li>\n<li>Changed the privileges of the user created in Step 2 to that of a Standard User.<\/li>\n<li>Restarted the machine.<\/li>\n<\/ol>\n<p>And then the fun begin. Windows wont allow the new administrative user to login into the system giving the &#8220;User profile could not be loaded&#8221; error due to the type in Step 3. As a result the machine had no user with administrative privileges. There was no way the registry key typo could be corrected within Windows.<\/p>\n<p>OS Re installation was looking the only good option.  Some questions to Google god and it pointed me to the right direction &#8211; Offline Registry editing.<\/p>\n<p>Offline registry editing means to edit the registry outside the Windows environment. Windows 7 has a super kool feature where you can go into repair mode  using your Installation DVD and execute the registry editor and actually edit the installed registry using the &#8220;Load Hive&#8221; option. This was a blessing for me.<\/p>\n<p>Listed below are the steps which i performed<\/p>\n<ol>\n<li>Loaded the hive where the key was present and corrected the typo.<\/li>\n<li>Restarted the machine.<\/li>\n<li>Logged into new user. (Voila! it worked)<\/li>\n<\/ol>\n<p>Learned a bit about Windows 7 repair mode system tools as a result of this whole process and looking forward for more 😉<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every time I install windows I find a new way to screw up things. In this process i also manage to learn something new. This time it was a kool issue which resulted in a deadlock. Installed Win 7. The &#8220;Administrator&#8221; user is disabled during installation. Created a user which had administrative privileges. Changed the &hellip; <a href=\"http:\/\/localhost\/blogs\/linux\/how-offline-registry-editing-with-windows-7-saved-my-life-kidding\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">How Offline registry editing with Windows 7 saved my life (Kidding)<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/92"}],"collection":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/comments?post=92"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/posts\/92\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/media?parent=92"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/categories?post=92"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/linux\/wp-json\/wp\/v2\/tags?post=92"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}