{"id":125,"date":"2013-09-02T00:04:22","date_gmt":"2013-09-01T18:34:22","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=148"},"modified":"2013-09-02T00:06:21","modified_gmt":"2013-09-01T18:36:21","slug":"if-some-companies-sold-bhelpuri","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/if-some-companies-sold-bhelpuri\/","title":{"rendered":"If some companies sold Bhelpuri"},"content":{"rendered":"<ol>\n<li><strong>Apple :<\/strong> Apple would only sell Rs 500 bhelpuri. They will be sold in a packet built with the high quality smooth paper. Each bhelpuri will be of the exact same dimensions. Bhel&#8217;s will be processed in a highly secret facility in Himalayas. Apple would only let approved places to sell its bhelpuri but would not approve any seller from any of the chowpati&#8217;s due to a company policy.<\/li>\n<li><strong>Google :<\/strong> Google would not make the actual bhelpuri but will open source the recipe of bhelpuri so that any bhelpuri seller would be able to sell in their own packaging. Every package would have a Google Ad on it.<\/li>\n<li><strong>Microsoft:<\/strong> Microsoft would not sell bhelpuris itself but would partner with other companies who would add extra ingredients and package it for them. Their bhelpuris would be so popular and overpriced that people would steal bhelpuris from the shop.<\/li>\n<li><strong>Samsung:<\/strong> Samsung would make all of the bhelpuri packet designs similar to that used by Apple. There would be bhelpuri&#8217;s ranging from Rs 10 to Rs 500. All Chowpati stores will have the Samsung bhelpuri&#8217;s.<\/li>\n<li><strong>Micromax:<\/strong>  Micromax would get inspired by Samsung and other bhelpuri vendors.They would make one of the cheapest bhelpuri&#8217;s. They would manage to bring Amitabh Bachan to advertise their bhelpuris&#8217;.<\/li>\n<li><strong>Nokia:<\/strong> It would take a long time for Nokia to even realize that people like to eat Bhelpuris. They would be selling only cold drinks till Samsung manages to take all its business. It would then partner with Microsoft and agree to sell and package Microsoft&#8217;s Bhelpuri&#8217;s.<\/li>\n<li><strong>Oracle:<\/strong> They would add panipuri , Minerial water , some shoes a tie and a bhelpuri packet in a colorful big box and call it Exa-Bhel.<\/li>\n<li><strong>IBM:<\/strong> They would only sell bhelpuris outside Business parks and to those people who have a tie.<\/li>\n<li><strong>Indian IT service based companies:<\/strong> They will offer to prepare the bhelpuris without puris at the cheapest cost. Companies like IBM would add the required puris , improve the packaging and sell it.<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>Apple : Apple would only sell Rs 500 bhelpuri. They will be sold in a packet built with the high quality smooth paper. Each bhelpuri will be of the exact same dimensions. Bhel&#8217;s will be processed in a highly secret facility in Himalayas. Apple would only let approved places to sell its bhelpuri but would &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/if-some-companies-sold-bhelpuri\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">If some companies sold Bhelpuri<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/125"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=125"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/125\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=125"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=125"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=125"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}