{"id":136,"date":"2013-09-14T13:55:16","date_gmt":"2013-09-14T08:25:16","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=162"},"modified":"2013-09-14T13:57:33","modified_gmt":"2013-09-14T08:27:33","slug":"instant-gratification-and-genxyz","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/instant-gratification-and-genxyz\/","title":{"rendered":"Instant gratification and GenXYZ"},"content":{"rendered":"<p>Whoever said that Gen X,Y,Z always crave instant gratification did not shop online in Indian websites. In the olden days, When ppl from my parents generation decided to buy anything for home, they use to follow the simple steps<\/p>\n<ol>\n<li>Arrange the money.<\/li>\n<li>Visit a store.<\/li>\n<li>Finalize the deal for whatever best is available in that store or nearby stores in the market (After all nobody wanted to go home empty handed).<\/li>\n<li>Pay for it.<\/li>\n<li>Get the thing home which you just paid for.<\/li>\n<\/ol>\n<p>When Gen XYZ wants to buy a thing they follow these simple steps<\/p>\n<ol>\n<li>Search online for days sometime even months for the perfect model from their favorite brand.<\/li>\n<li>Search a zillion shopping sites which offer you a good deal, EMI option etc.<\/li>\n<li>Zero on the particular shopping site from which they want to buy.<\/li>\n<li>Wait for the new billing cycle to start on their credit cards.<\/li>\n<li>Finally on a fine day , click on the buy button.<\/li>\n<li>Wait for the online site to process your payment information for a day or two.<\/li>\n<li>Wait for the site to actually ship the item.<\/li>\n<li>Wait for the item to actually reach you . This can be a painful step as courier companies are known to extremely efficient and always seem to care about the customer&#8217;s time.<\/li>\n<li>At times, wait for few more days as your package could be stuck between 2 galaxies courtesy the courier guys.<\/li>\n<li>On the day when your stars are aligned, you finally get your hands on that package of yours.<\/li>\n<\/ol>\n<p>Now comparing the shopping habits of this generation to their parents generation, it does not take a supercomputer from NASA to conclude which generation seeks instant gratification. Gen XYZ would win hands down and even the pre XYZ generation guys would also fully agree to that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whoever said that Gen X,Y,Z always crave instant gratification did not shop online in Indian websites. In the olden days, When ppl from my parents generation decided to buy anything for home, they use to follow the simple steps Arrange the money. Visit a store. Finalize the deal for whatever best is available in that &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/instant-gratification-and-genxyz\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Instant gratification and GenXYZ<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/136"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=136"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/136\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=136"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=136"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=136"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}