{"id":26,"date":"2007-12-13T00:28:00","date_gmt":"2007-12-12T18:58:00","guid":{"rendered":"http:\/\/www.latish-sherigar.com\/blogs\/iLatish\/?p=23"},"modified":"2007-12-13T00:28:00","modified_gmt":"2007-12-12T18:58:00","slug":"mailariabeware-of-it","status":"publish","type":"post","link":"http:\/\/localhost\/blogs\/iLatish\/mailariabeware-of-it\/","title":{"rendered":"Mailaria&#8230;.Beware of it"},"content":{"rendered":"<p>&#8220;Mailaria&#8221; is a disease which is found in modern IT enabled offices . This disease is caused by excessive usage of emails by some really process oriented guys.<\/p>\n<p>The symtoms of this disease are when a person will ask to send emails for very basic tasks such as asking him for a cup of tea. Usually the patient is not aware of his condition till bought to notice by some external entity.These guys will not do anything unless u put this information in a email. Even if you plead before them that you rit now are not in a position to send a mail they wont budge. During last stages of this disease, patients are known to shout  or hit their bosses for not informing something through mail. After this stage the patient is usually kicked out from the office 🙂<\/p>\n<p>There is no known cure for this disease as of now. The only treatment that is known to work is banging the patients head to their monitors or breaking their machine to pieces in front of them. Another technique that is found to be effective is deleting all mails from their inbox. This leaves them in such a state of shock so that they usually take a leave from office for a month or two, which means there are less obstacles to your work  and therefore your job might get done faster.<\/p>\n<p>So next time if you find anybody infected with this dangerous disease run away from them as far as possible probably to the other end of the office as these idiots otherwise will eat up your precious time in getting you to composing emails all day.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;Mailaria&#8221; is a disease which is found in modern IT enabled offices . This disease is caused by excessive usage of emails by some really process oriented guys. The symtoms of this disease are when a person will ask to send emails for very basic tasks such as asking him for a cup of tea. &hellip; <a href=\"http:\/\/localhost\/blogs\/iLatish\/mailariabeware-of-it\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Mailaria&#8230;.Beware of it<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/26"}],"collection":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/comments?post=26"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/posts\/26\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/media?parent=26"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/categories?post=26"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/blogs\/iLatish\/wp-json\/wp\/v2\/tags?post=26"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}